/**
 * Created by Soon on 9/2/2015.
 */
export default class RegExes {
  static MOBILE = /^(0|86|17951)?(13[0-9]|15[012356789]|17[678]|18[0-9]|14[57])[0-9]{8}$/;
  static POSITIVE_INTEGER = /^[1-9]\d*$/;
  static MATRIX_VALUE = /matrix(?:(3d)\(-{0,1}\d+(?:, -{0,1}\d+)*(?:, (-{0,1}\d+))(?:, (-{0,1}\d+))(?:, (-{0,1}\d+)), -{0,1}\d+\)|\(-{0,1}\d+(?:, -{0,1}\d+)*(?:, (-{0,1}\d+))(?:, (-{0,1}\d+))\))/;
  //static NON_NULL = /^[^\s]*$/g;
  static NON_NULL = /[A-Za-z0-9|\u4e00-\u9fa5]+$/g; //只能是字母、数字、中文字符

  /*
   //身份证正则表达式(15位)
   isIDCard1=/^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/;
   //身份证正则表达式(18位)
   isIDCard2=/^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/;
   身份证正则合并：(^\d{15}$)|(^\d{17}([0-9]|X)$)
   提取信息中的网络链接:(h|H)(r|R)(e|E)(f|F) *= *('|")?(\w|\\|\/|\.)+('|"| *|>)?
   提取信息中的邮件地址:\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*
   提取信息中的图片链接:(s|S)(r|R)(c|C) *= *('|")?(\w|\\|\/|\.)+('|"| *|>)?
   提取信息中的IP地址:(\d+)\.(\d+)\.(\d+)\.(\d+)
   提取信息中的中国手机号码:(86)*0*13\d{9}
   提取信息中的中国固定电话号码:(\(\d{3,4}\)|\d{3,4}-|\s)?\d{8}
   提取信息中的中国电话号码（包括移动和固定电话）:(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}
   提取信息中的中国邮政编码:[1-9]{1}(\d+){5}
   提取信息中的中国身份证号码:\d{18}|\d{15}
   提取信息中的整数：\d+
   提取信息中的浮点数（即小数）：(-?\d*)\.?\d+
   提取信息中的任何数字 ：(-?\d*)(\.\d+)?
   提取信息中的中文字符串：[\u4e00-\u9fa5]*
   提取信息中的双字节字符串 (汉字)：[^\x00-\xff]*

   */
}
